import React, { useEffect, useState } from "react";
import { useTranslation } from "react-i18next";
import { FiChevronRight } from "react-icons/fi";
import Button from "@mui/material/Button";
import { useForm } from "react-hook-form";
import { yupResolver } from "@hookform/resolvers/yup";
import * as yup from "yup";
import InputValidation from "../FormField/InputValidation";
import { useDispatch, useSelector } from "react-redux";
import { useLocation, useNavigate } from "react-router-dom";
import { LoadingButton } from "@mui/lab";
import { login, reset } from "../../features/auth/authSlice";
import toast from "react-hot-toast";
import Dialog from '@mui/material/Dialog';
import DialogActions from '@mui/material/DialogActions';
import DialogContent from '@mui/material/DialogContent';
import DialogContentText from '@mui/material/DialogContentText';
import { Checkbox, DialogTitle, FormControlLabel } from "@mui/material";


const LoginUsername = ({ setPage, formData, setFormData }) => {
    const { t } = useTranslation();
    const dispatch = useDispatch();
    const [showPolicy, setShowPolicy] = useState(false)
    const navigate = useNavigate();
    const location = useLocation();
    const [checked, setChecked] = React.useState(false);

    // const docs = [
    //     { uri: 'https://docs.google.com/document/d/1rU4SxUhkYIt3-7wdY8Rt5WKbOQSagwpW0PjDJV8-xE4/edit?usp=sharing' },
    // ]

    const from = location.state?.from?.pathname || "/";

    const { user, isLoading, isError, isSuccess, message } = useSelector(
        (state) => state.auth
    );
    const handleClickOpen = () => {
        setShowPolicy(true);
    };

    const checkedPolicy = () => {
          navigate(from, { replace: true });
    }

    const handleClose = () => {
        localStorage.removeItem('user')
        localStorage.removeItem('token')
        setShowPolicy(false);
    };

    const schema = yup.object().shape({
        username: yup.string().required(t("usernameRequired")),
        password: yup.string().required(t("passwordRequired")),
    });

    // useEffect(_ => {
    //     document.addEventListener('scroll', trackScrolling());
    // }, [showPolicy]) 

    const {
        handleSubmit,
        register,
        formState: { errors },
    } = useForm({ resolver: yupResolver(schema) });

    const onSubmit = ({ username, password }) => {
        const newFormData = { username, password };
        dispatch(login(newFormData));
        // setFormData({ ...formData, username });
        // setPage((prevPage) => prevPage + 1);
    };

    const handleChange = (event) => {
        setChecked(event.target.checked);
    };

    // const isBottom = (el) => {
    //     console.log(el.getBoundingClientRect())
    //     return el.getBoundingClientRect().bottom <= window.innerHeight;
    // }

    // const trackScrolling = () => {
    //     const wrappedElement = document.getElementById('alert-dialog-slide-description');
    //     console.log(wrappedElement)
    //     if (wrappedElement&& isBottom(wrappedElement)) {
    //       console.log('header bottom reached');
    //       document.removeEventListener('scroll', trackScrolling());
    //     }
    //   };

    useEffect(() => {
        if (isError) {
            toast.error(message);
        }

        if (isSuccess) {
            console.log(user)
            // if(user.firstLogin){
            //     setShowPolicy(true)
            // }else{
            //     navigate(from, { replace: true });
            // }
              navigate(from, { replace: true });
        }

        dispatch(reset());
    }, [isError, isSuccess, message, navigate, dispatch]);


    return (
        <>
            <form className="pt-[50px]" onSubmit={handleSubmit(onSubmit)}>
                <div className="mb-6">
                    <InputValidation
                        id="username"
                        label={t("username")}
                        {...register("username")}
                        errors={errors.username}
                        placeholder={t("username")}
                        autoFocus
                    />
                </div>

                <div className="mb-8">
                    <InputValidation
                        id="password"
                        type="password"
                        label={t("password")}
                        {...register("password")}
                        errors={errors.password}
                        placeholder={t("password")}
                    // autoComplete="new-password"

                    />
                </div>
                <div className="mt-8">
                    <LoadingButton
                        variant="contained"
                        type="submit"
                        fullWidth
                        loading={isLoading}
                    >
                        {t("login")}
                    </LoadingButton>
                    {/* <Button
                        variant="contained"
                        type="button"
                        fullWidth
                        onClick={() => setShowPolicy(true)}
                        endIcon={<FiChevronRight />}
                    >
                        {t("continue")}
                    </Button> */}
                </div>
                {/* <div className="mt-8">
         
        </div> */}
            </form>
            <Dialog
                open={showPolicy}
                // TransitionComponent={Transition}
                keepMounted
                // onClose={handleClose}
                aria-describedby="alert-dialog-slide-description"
                sx={{
                    '.MuiDialog-paper': {
                        maxWidth: 800
                    }
                }}
            >
                <DialogTitle  className="text-center text-[20px]">{"นโยบายคุ้มครองข้อมูลส่วนบุคคลสำหรับระบบ แ"}</DialogTitle>
                <DialogContent>
                    {/* <div>
                    <DocViewer
        pluginRenderers={DocViewerRenderers}
        documents={docs}
        config={{ pdfVerticalScrollByDefault: true }}
      />
                    </div> */}
                    {/* <DialogContentText id="alert-dialog-slide-description"> */}
                        <div className="how-to text-[#666] text-justify text-[13px] leading-[1.5]">
                            <strong className="text-right mb-3 block text-[#3d3b3b]">ฉบับวันที่ 5 สิงหาคม พ.ศ. 2566</strong>
                            <p className="indent-6"><strong className="text-[#3d3b3b]">บริษัท รวมถาวรขนส่ง จำกัด</strong> ซึ่งต่อไปนี้จะเรียกว่า <strong className="text-[#3d3b3b]">“ผู้อนุญาต”</strong> ตระหนักถึงความสำคัญในการคุ้มครองข้อมูลส่วนบุคคลที่ผู้ใช้งานได้มอบ หรือจะได้มอบไว้ให้แก่ผู้อนุญาต ดังนั้น ผู้อนุญาตจึงได้จัดทำนโยบายการคุ้มครองข้อมูลส่วนบุคคลนี้ เพื่อแจ้งให้ผู้ใช้งานได้ทราบและเข้าใจถึงวิธีการปฏิบัติของผู้อนุญาตเกี่ยวกับการเก็บ รวบรวม ใช้ เปิดเผย ข้อมูลส่วนบุคคลของผู้ใช้งาน ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 และตามนโยบายคุ้มครองข้อมูลส่วนบุคคลของผู้อนุญาต</p>
                            <br />
                            <h5 className="text-[16px] text-[#3d3b3b] mb-2">1. คำนิยาม</h5>
                            <div>
                                <p className="indent-6 mb-2">
                                    <strong className="text-[#3d3b3b]">“ระบบ RTT TMS”</strong> หมายความถึง ระบบบริหารและติดตามการขนส่ง ที่จะติดตามการขนส่งและตำแหน่งของยานพาหนะด้วยดาวเทียม รวมถึงเก็บข้อมูลการใช้งานรถและข้อมูลพฤติกรรมการขับขี่ โดยจะมีการติดตั้งอุปกรณ์ไว้ที่ยานพาหนะที่ต้องการจะติดตามข้อมูล
                                </p>
                                <p className="indent-6 mb-2">
                                    <strong className="text-[#3d3b3b]">“ผู้รับอนุญาต”</strong> หมายความถึง ผู้รับอนุญาตให้เป็นผู้ให้บริการระบบ RTT TMS เพื่อให้ผู้ใช้งานสามารถเข้าถึง เชื่อมโยง ติดตามผลข้อมูล ซึ่งในที่นี้หมายถึง บริษัท วันลิ้งค์ เทคโนโลยี่ จํากัด
                                </p>
                                <p className="indent-6 mb-2">
                                <strong className="text-[#3d3b3b]">“ผู้อนุญาต”</strong> หมายความถึง ผู้ถือลิขสิทธิ์ของระบบ RTT TMS ซึ่งในที่นี่หมายถึง บริษัท รวมถาวรขนส่ง จำกัด โดยผู้อนุญาตจะมอบหมายหน้าที่การให้บริการแก่ ผู้รับอนุญาต ซึ่งได้รับแต่งตั้งให้เป็นผู้จัดหาสินค้าและบริการของผู้อนุญาต                                </p>
                                <p className="indent-6 mb-2">
                                <strong className="text-[#3d3b3b]">“ผู้ใช้งาน”</strong> หมายความถึง บุคคลธรรมดา หรือนิติบุคคล หรือองค์กรธุรกิจใดๆ ไม่ว่าจะมีการจดทะเบียนตามกฎหมายหรือไม่ก็ตาม บุคคลธรรมดา หรือนิติบุคคล หรือองค์กรธุรกิจ ดังกล่าวสามารถสมัคร (ลงทะเบียน) สมาชิก และถือทะเบียนบัญชีสมาชิกที่ใช้ระบบ RTT TMS ได้ ไม่ว่าการเข้าถึงนั้นจะกระทำด้วยวิธีใด ลักษณะใด ผ่านอุปกรณ์ใด ผ่านช่องทางใด และไม่ว่ามีค่าใช้จ่ายหรือไม่ก็ตาม โดยผู้ใช้งานยืนยันและรับรองว่า ตนมีความสามารถในการทำนิติกรรม และมีอำนาจในการผูกพันกับข้อตกลงนี้                                </p>
                                <p className="indent-6 mb-2">
                                <strong className="text-[#3d3b3b]">“เว็บไซต์”</strong> หมายความถึง เว็บสำหรับเข้าใช้งานระบบ RTT TMS เพื่อการเข้าถึงและใช้งานระบบ RTT TMS                                </p>
                                <p className="indent-6 mb-2">
                                <strong className="text-[#3d3b3b]">“แอปพลิเคชัน”</strong> หมายความถึง แอปพลิเคชันสำหรับเข้าใช้งาน RTT TMS บนโทรศัพท์มือถือหรืออุปกรณ์ดิจิตอล                                </p>
                                <p className="indent-6 mb-2">
                                <strong className="text-[#3d3b3b]">“นโยบาย”</strong> หมายความถึง นโยบายคุ้มครองข้อมูลส่วนบุคคลสำหรับระบบ RTT TMS                                </p>
                            </div>
                            <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">2. คำนิยาม</h5>
                            <div className="mt-2">
                                <p className="indent-6 mb-2">
                                ผู้อนุญาตเคารพในความเป็นส่วนตัวของผู้ใช้บริการ และยินดีที่จะปกป้องข้อมูลส่วนตัวของผู้ใช้บริการ รวมถึงข้อมูลส่วนตัวที่รวบรวมได้ ซึ่งขึ้นอยู่กับบริการที่ผู้ใช้บริการต้องการและข้อตกลงแล้วแต่กรณี จึงเป็นสิ่งสำคัญที่ผู้อนุญาตจะต้องทำให้ผู้ใช้บริการเข้าใจถึงขั้นตอนวิธีการในการจัดเก็บ และการประมวลผลข้อมูลเกี่ยวกับการใช้บริการ
                                </p>
                                <p className="indent-6 mb-2">
                                โปรดอ่านและทำความเข้าใจนโยบายความเป็นส่วนตัวนี้อย่างละเอียด การที่ผู้ใช้งานได้ติดตั้ง และ/หรือ เข้าใช้งานเว็บไซต์ หรือแอปพลิเคชันนี้แล้ว ถือว่าผู้ใช้งานตกลงยอมรับข้อตกลงและเงื่อนไขที่ระบุในนโยบายความเป็นส่วนตัวนี้แล้วทุกประการ
                                </p>
                                <p className="indent-6 mb-2">
                                หากผู้ใช้งานไม่สามารถยอมรับข้อตกลงและเงื่อนไขนโยบายความเป็นส่วนตัวนี้ได้ ขอให้ผู้ใช้งานปฏิเสธการใช้งานเว็บไซต์และแอปพลิเคชันโดยออกจากหน้าเว็บไซต์ และ/หรือ ถอนการติดตั้งแอปพลิเคชันจากเครื่องโทรศัพท์มือถือหรืออุปกรณ์ดิจิตอลของผู้ใช้งานทันที</p>
                                
                            </div>
                            <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">3. ขอบเขตของนโยบายนี้</h5>
                            <div className="mt-2">
                                <p className="indent-6 mb-2">
                                นโยบายฉบับนี้ ครอบคลุมข้อมูลส่วนบุคคลที่ผู้อนุญาตได้รับหรือเก็บรวบรวมจากการที่ผู้ใช้งานเข้าเยี่ยมชม ซื้อสินค้าและบริการ สมัครสมาชิก ต่ออายุสัญญา ให้คำแนะนำ ติชม ร้องเรียน การทำแบบสำรวจ แบบสอบถาม หรือทำกิจกรรมอื่นใดเท่าที่จำเป็นผ่านทางเว็บไซต์ และแอพพลิเคชั่นบนโทรศัพท์มือถือของระบบ RTT TMS ช่องทางสื่อสังคมออนไลน์ ผู้รับอนุญาต และตัวแทนจำหน่ายของผู้อนุญาต ทั้งนี้ จะไม่ครอบคลุมถึงการใช้งานของผู้ใช้งานบนเว็ปไซต์ แอพพลิเคชั่น ช่องทางสื่อสังคมออนไลน์ ของบุคคลที่สามที่สามารถเชื่อมโยงมายังเว็ปไซต์ และแอปพลิเคชันของผู้อนุญาต และไม่ครอบคลุมถึงบุคคลที่สามที่ไม่ได้อยู่ภายใต้การดูแลของผู้อนุญาต
                                </p>
                                <p className="indent-6 mb-2">
                                ดังนั้น ผู้อนุญาตจึงขอแนะนำให้ผู้ใช้งานโปรดอ่านนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้ เพื่อรับทราบและทำความเข้าใจวิธีการ แนวทาง และวัตถุประสงค์ที่ผู้อนุญาตได้เก็บรวบรวม ใช้และเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้งาน
                                </p>
                                ดังนั้น ผู้อนุญาตจึงขอแนะนำให้ผู้ใช้งานโปรดอ่านนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้ เพื่อรับทราบและทำความเข้าใจวิธีการ แนวทาง และวัตถุประสงค์ที่ผู้อนุญาตได้เก็บรวบรวม ใช้และเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้งาน
                                
                            </div>
                            <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">4. ข้อจำกัดการใช้นโยบายความเป็นส่วนตัว</h5>
                            <div className="mt-2">
                                <p className="indent-6 mb-2">
                                นโยบายความเป็นส่วนตัวฉบับนี้ มีผลใช้บังคับกับระบบ RTT TMS นี้เท่านั้น ไม่รวมถึงแอปพลิเคชันและหรือบริการอื่นใดที่มีนโยบายความเป็นส่วนตัวแยกต่างหาก และ/หรือ ที่ไม่ได้กำหนดโดยชัดแจ้งให้ใช้ร่วมกันกับนโยบายความเป็นส่วนตัวนี้ ตลอดจนไม่มีผลใช้บังคับกับแอปพลิเคชันและบริการ หรือเว็บไซต์อื่นๆ ที่เชื่อมต่อกับเว็บไซต์หรือแอปพลิเคชันนี้ รวมถึงไม่ครอบคลุมหลักปฏิบัติด้านข้อมูลส่วนบุคคลของผู้อนุญาตอื่นๆ หรือองค์กรอื่นๆ ที่โฆษณาผ่านทางแอปพลิเคชันของผู้อนุญาต ซึ่งอาจใช้คุกกี้ พิกเซลแท็ก และเทคโนโลยี่อื่นๆ ในการนำเสนอและแสดงโฆษณาที่เกี่ยวข้อง
                                </p>
                               
                            </div>
                            <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">5. บุคคลที่มีหน้าที่รับผิดชอบตามกฎหมาย</h5>
                            <div className="mt-2">
                                <p className="indent-6 mb-2">
                                ผู้อนุญาตในฐานะผู้ควบคุมข้อมูลส่วนบุคคล ตามนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้ จะเป็นผู้กำหนดวัตถุประสงค์และวิธีการประมวลผลข้อมูลส่วนบุคคล ดังนั้น ผู้อนุญาตจึงมอบหมายให้ ผู้รับอนุญาตเป็น “ผู้ประมวลผลข้อมูลส่วนบุคคล” ตามนิยามของประกาศของคณะกรรมการกิจการกระจายเสียง กิจการโทรทัศน์และกิจการโทรคมนาคมแห่งชาติ ว่าด้วยเรื่อง มาตรการ คุ้มครองสิทธิของผู้ใช้บริการโทรคมนาคม รวมถึงพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.2562 เกี่ยวกับข้อมูลส่วนบุคคล สิทธิในความเป็นส่วนตัวและเสรีภาพในการสื่อสารถึงกันโดยทางโทรคมนาคม รวมถึงกฎหมายอื่นที่เกี่ยวข้อง
                                </p>
                                <p className="indent-6 mb-2">
                                นอกจากนี้ ผู้อนุญาตมีความรับผิดชอบตามกฎหมาย เพื่อทำให้การใช้ข้อมูลส่วนบุคคลของผู้ใช้งานนั้น เป็นไปตามหลักนโยบายความเป็นส่วนตัวที่สำคัญ นโยบายความเป็นส่วนตัวนี้ และกฎหมายที่ใช้บังคับ
                                </p>
                               
                            </div>
                            <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">6. การเก็บรวบรวมข้อมูลส่วนบุคคลของผู้ใช้งาน</h5>
                            <div className="mt-2">
                                <p className="indent-6 mb-2">
                                ในขณะที่ผู้ใช้งานติดต่อผู้อนุญาตผ่านช่องทางการสื่อสารใดๆ ของผู้อนุญาต หรือผู้รับอนุญาต หรือตัวแทนของผู้อนุญาต ผู้อนุญาตอาจมีความจำเป็นต้องเก็บรวบรวมข้อมูลส่วนบุคคลของผู้ใช้งาน ดังต่อไปนี้
                                </p>
                                <p className="indent-6 mb-2">
                                (1) ข้อมูลส่วนตัว ได้แก่ คำนำหน้าชื่อ, ชื่อ-นามสกุล, เพศ, วันเดือนปีเกิด, อายุ, หมายเลขบัตรประชาชน, หมายเลขหนังสือเดินทาง, เลขประจำตัวผู้เสียภาษีอากร, สัญชาติ, เลขใบอนุญาตขับขี่ เป็นต้น                                
                                </p>
                                <p className="indent-6 mb-2">
                                (2) ข้อมูลเพื่อการติดต่อ ได้แก่ หมายเลขโทรศัพท์, ที่อยู่ทางไปรษณีย์เพื่อจัดใบแจ้งหนี้, ที่อยู่สำหรับระบุในใบเสร็จรับเงิน, ที่อยู่ทางไปรษณีย์อิเล็กทรอนิกส์ (e-mail address), บัญชีผู้ใช้ในเว็บไซต์โซเชียล เป็นต้น                                
                                </p>
                                <p className="indent-6 mb-2">
                                (3) ข้อมูลทางการเงิน ได้แก่ ช่องทางชำระเงิน ข้อมูลบัตรเดบิต/บัตรเครดิต, เลขบัญชีธนาคาร เป็นต้น                                </p>
                                <p className="indent-6 mb-2">
                                (4) ข้อมูลการทำธุรกรรมการซื้อขายสินค้าและบริการ ได้แก่ ข้อมูลเกี่ยวกับการรับชำระเงินจากผู้ใช้งาน, วันที่ชำระเงิน, เวลาชำระเงิน, ยอดชำระเงิน, หมายเลขการซื้อ, วัน/เวลาในการรับหรือจัดส่งสินค้า, ข้อความตอบรับสินค้าจากผู้ใช้งาน, ข้อมูลการรับประกันสินค้า, คำร้องเรียนและข้อร้องเรียน และข้อมูลอื่น ๆ ที่เกี่ยวข้องกับ การซื้อสินค้าและบริการจากผู้ใช้งาน                                </p>
                                <p className="indent-6 mb-2">
                                (5) ข้อมูลเกี่ยวกับพฤติกรรม ได้แก่ ข้อมูลเกี่ยวกับพฤติกรรมการซื้อสินค้า และบริการของผู้ใช้งาน และข้อมูลการตอบรับความพึงพอใจของผู้ใช้งานที่มีต่อการให้บริการของผู้อนุญาต                                </p>
                                <p className="indent-6 mb-2">
                                (6) ข้อมูลผู้ขับรถ ได้แก่ ชื่อและเบอร์ติดต่อของผู้ขับรถ, พฤติกรรมการขับขี่                                
                                </p>
                                <p className="indent-6 mb-2">
                                (7) ข้อมูลบริษัท ได้แก่ ประเภทธุรกิจของผู้ใช้งาน                                </p>
                                <p className="indent-6 mb-2">
                                (8) ข้อมูลรถ ได้แก่ ข้อมูลของรถ, ระยะทาง, ชั่วโมงการทำงาน, เลขไมล์รถ, ตำแหน่งรถ, เวลารถวิ่ง, เวลาจอดดับเครื่อง, เวลารถจอดไม่ดับเครื่อง, สัญญาณออฟไลน์, ประวัติข้อมูลการขับรถย้อนหลัง, ประวัติการบำรุงรักษารถ, ข้อมูลอัตราการกินน้ำมันของรถ และข้อมูลปริมาณการใช้น้ำมัน                                </p>
                                <br />
                                <p className="indent-6 mb-2">
                                ทั้งนี้ ผู้อนุญาตจะเก็บข้อมูลส่วนตัวของผู้ใช้งาน ตามความจำเป็นในการใช้งานตามวัตถุประสงค์ที่ระบุไว้ในนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้เท่านั้น โดยในการเก็บ รวบรวม ใช้ หรือ เปิดเผย ข้อมูลของผู้ใช้งานแก่บุคคลภายนอก ผู้อนุญาตจะขอความยินยอมเป็นลายลักษณ์อักษร หรือวิธีการทางอิเล็กทรอนิกส์จากผู้ใช้งานก่อน ซึ่งผู้ใช้งานมีสิทธิที่จะไม่ให้ความยินยอมในการใช้ข้อมูลส่วนตัวของผู้ใช้งานก็ได้ แต่อาจส่งผลให้ผู้อนุญาตไม่สามารถให้บริการกับผู้ใช้งานสำหรับเรื่องนั้นๆ ได้                                </p>
                                <p className="indent-6 mb-2">
                                ข้อมูลส่วนบุคคลที่ผู้ใช้งานมอบให้แก่ผู้อนุญาตจะต้องเป็นข้อมูลที่ถูกต้อง ครบถ้วนสมบูรณ์ เป็นความจริง และไม่ทำให้เกิดความเข้าใจผิด และผู้ใช้งานจะต้องแก้ไขข้อมูลส่วนบุคคลของผู้ใช้งานให้เป็นปัจจุบัน และแจ้งให้ผู้อนุญาตทราบเกี่ยวกับการเปลี่ยนแปลงข้อมูลต่างๆ ผ่านช่องทางการติดต่อผู้อนุญาตที่ระบุไว้ในนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ หากผู้ใช้งานเลือกที่จะไม่ส่งข้อมูลส่วนบุคคลของผู้ใช้งานให้ผู้อนุญาต หรือเลือกที่จะเพิกถอนความยินยอมในการใช้ข้อมูลส่วนบุคคลของผู้ใช้งาน อาจส่งผลทำให้ผู้อนุญาตไม่สามารถให้บริการแก่ผู้ใช้งานได้                               
                                </p>
                               <br />
                            </div>
                            <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">7. วัตถุประสงค์ในการเก็บรวบรวม ใช้ เปิดเผยข้อมูลส่วนบุคคล</h5>
                            <div className="mt-2">
                                <p className="indent-6 mb-2">
                                ผู้อนุญาตจะเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนตัวของผู้ใช้งานเท่าที่จำเป็น โดยได้รับความยินยอมจากผู้ใช้งาน หรือด้วยเหตุอันชอบด้วยกฎหมาย เพื่อวัตถุประสงค์ต่อไปนี้
                                </p>
                                <p className="indent-6 mb-2">
                                (1) เพื่อใช้สำหรับการให้ข้อมูลเกี่ยวกับการขนส่งสินค้า หรือกิจกรรมอื่น ๆ ของ RTT TMS แต่ละพื้นที่
                                </p>
                                <p className="indent-6 mb-2">
                                (2) เพื่อข้อมูลในการ จัดส่ง/รับคืนสินค้า
                                </p>
                                <p className="indent-6 mb-2">
                                (3) เพื่อนำไปใช้ในการวิเคราะห์ วิจัยตลาด เพื่อใช้ในการวางแผนการตลาด และปรับปรุงสินค้าและบริการของผู้อนุญาต ให้ตรงกับความต้องการของผู้ใช้งานมากขึ้น
                                </p>
                                <p className="indent-6 mb-2">
                                (4) เพื่อวัตถุประสงค์อื่น ๆ ที่จำเป็นในการดำเนินธุรกิจของผู้อนุญาต และสร้างความสัมพันธ์ระหว่างผู้ใช้งานกับผู้อนุญาต                                </p>
                                <p className="indent-6 mb-2">
                                (5) เพื่อวิจัยและพัฒนาการขับรถให้ปลอดภัยและประหยัดมากยิ่งขึ้น                                </p>
                                <p className="indent-6 mb-2">
                                (6) เพื่อการบำรุงรักษารถยนต์ที่มีประสิทธิภาพเพิ่มมากขึ้น                                </p>
                                <p className="indent-6 mb-2">
                                (7) เพื่อวิจัยและพัฒนาผลิตภัณฑ์ให้เหมาะสมกับการใช้งานในอนาคต                                </p>
                                <p className="indent-6 mb-2">
                                (8) เพื่อปรับปรุงการให้บริการของ ผู้อนุญาต ผู้รับอนุญาต รวมทั้งตัวแทนจำหน่ายของผู้อนุญาต                                </p>
                                <p className="indent-6 mb-2">
                                (9) เพื่อพิจารณาสถานที่ในการจัดตั้ง ศูนย์การะจายสินค้า ของผู้อนุญาตแห่งใหม่                                </p>
                                <p className="indent-6 mb-2">
                                (10) เพื่อพัฒนาการให้บริการของผู้อนุญาต                                
                                </p>
                                <p className="indent-6 mb-2">
                                (11) เพื่อนำเสนอข้อมูลช่วงเวลาในการใช้งานเฉลี่ยของการขนส่งให้แก่ผู้ใช้งาน                                </p>
                                <p className="indent-6 mb-2">
                                (12) เพื่อรวบรวมข้อมูลประวัติงานขนส่งสำหรับการปรับปรุงบริการที่ดีขึ้น                                </p>
                                <p className="indent-6 mb-2">
                                (13) เพื่อเป็นข้อมูลให้ลูกค้าได้รับบริการที่เหมาะสมสำหรับผู้ใช้งานแต่ละราย                                </p>
                                <p className="indent-6 mb-2">
                                (14) เพื่อให้ประเมินการขนส่งที่เหมาะสม                                </p>
                                <p className="indent-6 mb-2">
                                ในกรณีที่ผู้อนุญาตนำข้อมูลส่วนบุคคลและข้อมูลการใช้งาน ของผู้ใช้งานออกใช้ประโยชน์ ผู้อนุญาตจะใช้ข้อมูลดังกล่าว ตราบเท่าที่ไม่ก่อให้เกิดความเสียหาย ความเดือดร้อนและความรำคาญแก่เจ้าของข้อมูล <span className="text-red-500">และจะไม่เปิดเผยข้อมูลดังกล่าวต่อ บุคคลภายนอก</span> ในลักษณะที่อาจระบุตัวตนของผู้ใช้งาน เจ้าของข้อมูลใด เว้นแต่เป็นการใช้และเปิดเผยตามที่กฎหมายกำหนด หรือโดยคำสั่งของหน่วยงานที่บังคับใช้อำนาจของรัฐ สำหรับการใช้ข้อมูลที่รวบรวม ผู้อนุญาตจะใช้ข้อมูลที่รวบรวมจากการใช้งานระบบ RTT TMS ของผู้ใช้งานในการให้บริการ บำรุงรักษา ป้องกัน ปรับปรุง พัฒนาการบริการใหม่ๆ ให้เหมาะสมกับการใช้งาน เพื่อเป็นประโยชน์และตรงกับความต้องการของผู้ใช้งานอย่างสูงสุด และเพื่อการพัฒนาและบำรุงรักษาระบบการให้บริการของผู้อนุญาตให้มีความปลอดภัยและมีประสิทธิภาพสูงสุด ผู้อนุญาตอาจทำความตกลงไว้กับบุคคลที่สาม เพื่อให้ดำเนินงานกับผู้อนุญาต หรือดำเนินการในนามของผู้อนุญาต เช่น บริษัทในเครือ กลุ่มบริษัท ตลอดจนคู่สัญญา ที่มีหน้าที่บริหารจัดการระบบ RTT TMS ตามสัญญากับผู้อนุญาตโดยตรง หรือผู้อนุญาตอื่นที่มีนโยบายเกี่ยวกับข้อมูลส่วนบุคคลที่น่าเชื่อถือ ซึ่งบุคคลที่สามนั้น จะต้องยอมรับข้อตกลงคุ้มครองข้อมูลส่วนตัวของผู้งานไว้เป็นความลับเช่นเดียวกัน
                                </p>
                                <p className="indent-6 mb-2">
                                สำหรับเหตุผลทางกฎหมาย ผู้อนุญาตอาจแบ่งปันหรือเปิดเผยข้อมูลของผู้ใช้งานกับผู้ที่ได้รับอนุญาต และ/หรือ องค์กรอื่น และ/หรือ บุคคลภายนอก หากผู้อนุญาตเชื่อโดยสุจริตว่าการเข้าถึง การใช้ การเก็บรักษาหรือการเปิดเผยข้อมูลนั้น มีเหตุจำเป็นอันสมควร อันได้แก่                             
                                </p>
                                <p className="indent-12 mb-2">
                                (1) เพื่อการปฏิบัติตามกฎหมาย ระเบียบข้อบังคับ หลักเกณฑ์ คำสั่งที่เกี่ยวข้อง และการร้องขอข้อมูลจากทางราชการ                                </p>
                                <p className="indent-12 mb-2">
                                    (2) เพื่อบังคับใช้ข้อตกลงและเงื่อนไขในการให้บริการที่เกี่ยวข้อง รวมถึงการตรวจสอบการละเมิดที่อาจเกิดขึ้น
                                </p>
                                <p className="indent-12 mb-2">
                                (3) เพื่อตรวจจับ ป้องกัน หรือตรวจสอบการทุจริต ปัญหาด้านความปลอดภัย
                                </p>
                                <p className="indent-12 mb-2">
                                (4) เพื่อป้องกันอันตรายต่อสิทธิ ทรัพย์สิน หรือความปลอดภัยของผู้อนุญาต และ/หรือ ของผู้ใช้งาน หรือบุคคลอื่นตามที่กฎหมายกำหนด
                                </p>
                                <p className="indent-12 mb-2">
                                หากผู้อนุญาตมีการเปลี่ยนแปลงโครงสร้างการบริหารงาน เช่น การควบรวมกิจการ การได้มา หรือการขายสินทรัพย์ ผู้อนุญาตจะยังคงรักษาข้อมูลส่วนบุคคลใดๆ ให้เป็นความลับ และแจ้งให้ผู้ใช้งานที่ได้รับผลกระทบทราบก่อนการโอนข้อมูลส่วนบุคคล หรือให้ข้อมูลส่วนบุคคลนั้นอยู่ภายใต้นโยบายความเป็นส่วนตัวอื่นๆ
                                </p>
                               
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">8. การเปิดเผยข้อมูลส่วนบุคคลแก่บุคคลภายนอก</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาตอาจทำการเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้งานให้แก่บุคคลภายนอกเท่าที่จำเป็น เพื่อให้เป็นไปตามวัตถุประสงค์ที่ระบุไว้ในนโยบายนี้ โดยผู้อนุญาตจะส่งข้อมูลส่วนบุคคลของผู้ใช้งานไปยังบุคคลดังต่อไปนี้                                    
                                    </p>
                                    <br />
                                    <p className="indent-6 mb-2">
                                    (1) บริษัท รวมถาวรขนส่ง จำกัด บริษัทในเครือ หรือบริษัทที่เกี่ยวข้องที่ตั้งอยู่ภายในประเทศไทย หรือในต่างประเทศ                                   
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (2) เจ้าหน้าที่ หรือ หน่วยงานของรัฐ เพื่อให้เป็นไปตามกฎ ระเบียบ ข้อบังคับของกฎหมายที่เกี่ยวข้อง
                                                                        </p>
                                    <p className="indent-6 mb-2">
                                    (3) บริษัท วันลิ้งค์ เทคโนโลยี่ จำกัด                                                           
                                          </p>
                                    <p className="indent-6 mb-2">
                                    (4) บุคคลภายนอกที่มีความเกี่ยวข้องกับการให้บริการนี้                                                         
                                          </p>
                                
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">9. สิทธิของผู้ใช้งานในฐานะเจ้าของข้อมูลส่วนบุคคล</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ผู้ใช้งานในฐานะเจ้าของข้อมูล มีสิทธิดังต่อไปนี้                                    
                                    </p>
                                    <br />
                                    <p className="indent-6 mb-2">
                                    (1) สิทธิในการได้รับแจ้งให้ทราบเกี่ยวกับข้อมูลส่วนตัวที่เก็บรวบรวม วิธีการเก็บรวบรวม วัตถุประสงค์ในการนำข้อมูลส่วนตัวไปใช้ บุคคลที่จะได้รับข้อมูล และระยะเวลาที่จัดเก็บข้อมูล
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (2) สิทธิในการขอเข้าถึงและขอรับสำเนาข้อมูลส่วนตัวของผู้ใช้งาน ซึ่งอยู่ในความรับผิดชอบของผู้อนุญาต
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (3) สิทธิในการขอให้ส่ง หรือโอนข้อมูลส่วนตัวของผู้ใช้งาน ไปยังผู้ควบคุมข้อมูลคนอื่นๆ ได้
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (4) สิทธิในการคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนตัวของผู้ใช้งาน
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (5) สิทธิในการขอให้ลบ หรือทำลาย หรือ ทำให้ข้อมูลส่วนตัวของผู้ใช้งาน เป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลได้                                    </p>
                                    <p className="indent-6 mb-2">
                                    (6) สิทธิในการขอให้ระงับการใช้ข้อมูลส่วนตัวของผู้ใช้งานไว้เป็นการชั่วคราว                                    </p>
                                    <p className="indent-6 mb-2">
                                    (7) สิทธิในการขอให้ผู้อนุญาตดำเนินการให้ข้อมูลส่วนตัวของผู้ใช้งานถูกต้อง สมบูรณ์ และเป็นปัจจุบัน                                    </p>
                                    <p className="indent-6 mb-2">
                                    (8) สิทธิในการร้องเรียนต่อผู้อนุญาต หรือคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล หากผู้ใช้งานเห็นว่าสิทธิใด ๆ ของผู้ใช้งาน ได้ถูกผู้อนุญาตละเมิด จนเป็นเหตุให้เกิดความเสียหายกับผู้ใช้งานในฐานะเจ้าของข้อมูล                                    </p>
                                    <p className="indent-6 mb-2">
                                    (9) สิทธิในการขอให้ผู้อนุญาตเปิดเผยถึงการได้มาของข้อมูลส่วนตัวของผู้ใช้งาน ในกรณีที่ผู้ใช้งานไม่ได้ให้ความยินยอมไว้                                    </p>
                                    <br />
                                    <p className="indent-6 mb-2">
                                    ในกรณีที่ผู้ใช้งานต้องการใช้สิทธิดังกล่าว ผู้ใช้งานจะต้องแสดงความจำนงขอใช้สิทธิเป็นลายลักษณ์อักษร และผู้อนุญาตจะใช้ความพยายามอย่างดีที่สุด ที่จะดำเนินการตามคำขอของผู้ใช้งาน ภายในระยะเวลาที่เหมาะสม และไม่เกินกว่าที่กฎหมายกำหนด โดยผู้อนุญาตจะปฏิบัติตามกฎหมายที่เกี่ยวข้องอย่างเคร่งครัด การใช้สิทธิขอลบ ทำลาย ทำให้ข้อมูลส่วนตัวของผู้ใช้งาน เป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลได้ ขอให้ระงับการใช้ข้อมูลเป็นการชั่วคราว หรือการเพิกถอนความยินยอม อาจส่งผลให้ผู้อนุญาตไม่สามารถให้บริการแก่ผู้ใช้งานในเรื่องที่เกี่ยวข้องได้                                    </p>
                                    
                                
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">10. ระยะเวลาในการจัดเก็บข้อมูลส่วนบุคคล</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาต จะจัดเก็บรักษาข้อมูลส่วนบุคคลของผู้ใช้งานไว้ ตามระยะเวลาเท่าที่จำเป็นสำหรับวัตถุประสงค์ ที่ได้ระบุไว้ในนโยบายนี้เท่านั้น ยกเว้น ในกรณีที่กฎหมายกำหนดให้เก็บข้อมูลส่วนบุคคลดังกล่าวในระยะเวลานานกว่านั้น และในกรณีที่พ้นระยะเวลาการจัดเก็บ หรือข้อมูลส่วนบุคคลของผู้ใช้งานไม่มีความจำเป็น ทางผู้อนุญาตจะทำการลบ ทำลาย หรือทำให้ข้อมูลส่วนบุคคลนั้นไม่สามารถระบุตัวบุคคลได้                                  
                                    </p>
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">11. มาตรการการคุ้มครองข้อมูลส่วนบุคคล</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาตจะจัดให้มีมาตรการรักษาความมั่นคงปลอดภัยที่เหมาะสม เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข หรือ เปิดเผย ข้อมูลส่วนบุคคลโดยปราศจากอำนาจหรือโดยมิชอบ และผู้อนุญาตจะทบทวนมาตรการดังกล่าว เมื่อมีความจำเป็นหรือเมื่อเทคโนโลยีเปลี่ยนแปลงไป เพื่อให้มีประสิทธิภาพในการรักษาความมั่นคงปลอดภัยที่เหมาะสม
                                    </p>
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">12. ความปลอดภัยของข้อมูล</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาตพยายามอย่างยิ่งที่จะปกป้องข้อมูลของผู้ใช้งานจากการเข้าถึง การแก้ไขเปลี่ยนแปลง การเปิดเผยหรือการทำลายโดยไม่ได้รับอนุญาตอย่างน้อย ดังนี้
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (1) ผู้อนุญาตจัดทำระบบ Call Center เพื่อใช้ยืนยันผู้ใช้งาน ในกรณีลืมรหัสผ่านเข้าใช้งาน                                    </p>
                                    <p className="indent-6 mb-2">
                                    (2) ผู้อนุญาตตรวจสอบการเก็บรวบรวมข้อมูล พื้นที่ในการจัดเก็บข้อมูลและหลักปฏิบัติในการประมวลผล รวมถึงมาตรการความปลอดภัยทางกายภาพ เพื่อป้องกันการเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต                                    </p>
                                    <p className="indent-6 mb-2">
                                    (3) ผู้อนุญาตจำกัดการเข้าถึงข้อมูลส่วนบุคคลไว้เฉพาะกับผู้รับอนุญาต พนักงาน ลูกจ้าง และตัวแทนของผู้อนุญาต ที่มีความจำเป็นต้องเข้าถึงข้อมูลนั้นๆ เพื่อทำการประมวลผลข้อมูล โดยที่บุคคลดังกล่าวนั้น จะต้องปฏิบัติตามข้อตกลงและเงื่อนไขเกี่ยวกับการรักษาข้อมูลที่เป็นความลับตามสัญญาอย่างเคร่งครัด หากฝ่าฝืนจะมีบทลงโทษขั้นรุนแรง                                    </p>
                                   
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">13. การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาตขอสงวนสิทธิ์ในการแก้ไขเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ได้ตลอดเวลา โดยไม่ต้องได้รับความยินยอมจากผู้ใช้งานล่วงหน้า เว้นแต่เป็นการแก้ไขเปลี่ยนแปลงที่เป็นการลิดรอนสิทธิของผู้ใช้งานตามนโยบายความเป็นส่วนตัวนี้ ผู้อนุญาตจะกระทำมิได้ หากไม่ได้รับความยินยอมจากผู้ใช้งานก่อน และเมื่อมีการแก้ไขเปลี่ยนแปลงแล้ว ผู้อนุญาตจะแจ้งให้ผู้ใช้งานทราบเป็นครั้งคราวไป                                    </p>
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">14. ข้อมูลเกี่ยวกับคุกกี้</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาตใช้คุกกี้ในเว็บไซต์นี้ เพื่อเป็นเครื่องมือช่วยแยกแยะรูปแบบการใช้งานเว็บไซต์ของผู้ใช้งานจากผู้ใช้งานรายอื่น ซึ่งจะช่วยให้ผู้ใช้งานได้รับประสบการณ์ที่ดีจากการใช้งานเว็บไซต์ และช่วยให้เราสามารถพัฒนาคุณภาพของเว็บไซต์ให้ดียิ่งขึ้น กรณีที่ผู้ใช้งานใช้งานเว็บไซต์นี้ต่อไป ถือว่าผู้ใช้งานได้ยินยอมให้เราติดตั้งคุกกี้ไว้ในเครื่องคอมพิวเตอร์ของผู้ใช้งาน
                                    </p>
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">15. การเข้าถึงและการปรับข้อมูลส่วนบุคคลให้เป็นปัจจุบัน</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาตมุ่งหวังเป็นอย่างยิ่งว่า ในการใช้เว็บไซต์หรือแอปพลิเคชัน ผู้ใช้งานสามารถเข้าถึงข้อมูลส่วนบุคคลของผู้ใช้งานได้ หากข้อมูลดังกล่าวมีความบกพร่องหรือไม่ถูกต้อง ผู้อนุญาตจะพยายามจัดหาวิธีการ และ/หรือ ช่องทางให้ผู้ใช้งานสามารถปรับข้อมูลให้เป็นปัจจุบัน และ/หรือ ลบข้อมูลส่วนบุคคลของผู้ใช้งานได้อย่างเหมาะสม เว้นแต่ ในกรณีมีความจำเป็นที่ผู้อนุญาตจะต้องจัดเก็บข้อมูลส่วนบุคคลของผู้ใช้งานไว้ เพื่อประโยชน์ในการให้บริการอย่างต่อเนื่อง และ/หรือ เพื่อการปฏิบัติตามกฎหมายที่ใช้บังคับ เมื่อผู้ใช้งานดำเนินการปรับข้อมูลส่วนบุคคลให้เป็นปัจจุบัน ผู้อนุญาตอาจร้องขอให้ผู้ใช้งานยืนยันตัวตนก่อนที่ผู้อนุญาตจะดำเนินการตามคำขอของผู้ใช้งานได้ ทั้งนี้ ผู้อนุญาตขอสงวนสิทธิปฏิเสธการทำคำขอปรับข้อมูลและการเข้าถึงข้อมูลส่วนบุคคลของผู้ใช้งาน ในกรณีดังต่อไปนี้
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (1) การทำคำขอที่ซับซ้อนและมีจำนวนมากเกินกว่าปกติ
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (2) การดำเนินการตามคำขออาจทำให้ผู้อนุญาตต้องจัดหา และ/หรือพัฒนาเทคโนโลยีจากที่ผู้อนุญาตมีอยู่เกินสมควร
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (3) การดำเนินการตามคำขออาจกระทบข้อมูลส่วนบุคคลของผู้ใช้งานอื่นๆ หรือ
                                    </p>
                                    <p className="indent-6 mb-2">
                                    (4) การดำเนินการตามคำขอไม่สามารถปฏิบัติได้จริง เช่น คำขอเกี่ยวกับการเรียกดูข้อมูลส่วนบุคคลที่อยู่ในระบบสำรองข้อมูล เป็นต้น
                                    </p>
                                    <p className="indent-6 mb-2">
                                    ผู้อนุญาตมุ่งหวังที่จะดำเนินการให้บริการบนระบบ RTT TMS ให้เป็นไปอย่างปลอดภัย และสามารถป้องกันการทำลายข้อมูลจากอุบัติเหตุหรือการมุ่งร้ายอื่นๆ ด้วยเหตุนี้ ภายหลังจากที่ผู้ใช้งานได้ยกเลิกการบริการระบบ RTT TMS ผู้อนุญาตอาจยังไม่ดำเนินการลบสำเนาข้อมูลส่วนบุคคลที่มีอยู่ออกจากเซิร์ฟเวอร์ที่ใช้งานอยู่ หรือนำข้อมูลออกจากระบบสำรองของผู้อนุญาตในทันที
                                    </p>
                                   
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">16. ข้อจำกัดการใช้นโยบายความเป็นส่วนตัว</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    นโยบายความเป็นส่วนตัวฉบับนี้ มีผลใช้บังคับกับระบบ RTT TMS นี้เท่านั้น ไม่รวมถึงแอปพลิเคชันและหรือบริการอื่นใด ที่มีนโยบายความเป็นส่วนตัวแยกต่างหาก และ/หรือ ที่ไม่ได้กำหนดโดยชัดแจ้งให้ใช้ร่วมกันกับนโยบายความเป็นส่วนตัวนี้ ตลอดจนไม่มีผลใช้บังคับกับแอปพลิเคชันและบริการ หรือเว็บไซต์อื่นๆ ที่เชื่อมต่อกับเว็บไซต์หรือแอปพลิเคชันนี้ รวมถึงไม่ครอบคลุมหลักปฏิบัติด้านข้อมูลส่วนบุคคลของผู้อนุญาตอื่น ๆ หรือองค์กรอื่นๆ ที่โฆษณาผ่านช่องทางแอปพลิเคชันของผู้อนุญาต ซึ่งอาจใช้คุกกี้ พิกเซลแท็ก และเทคโนโลยี่อื่น ๆ ในการนำเสนอและแสดงโฆษณาที่เกี่ยวข้อง
                                    </p>
                                </div>
                                <h5 className="text-[16px] mb-2 mt-6 text-[#3d3b3b]">17. การติดต่อเจ้าหน้าที่</h5>
                                <div className="mt-2">
                                    <p className="indent-6 mb-2">
                                    หากผู้ใช้งานมีข้อสงสัยที่เกี่ยวข้องกับนโยบายการคุ้มครองข้อมูลส่วนบุคคลนี้ หรือ ผู้ใช้งานประสงค์จะใช้สิทธิตามที่ระบุไว้ในข้อ 9. หรือประสงค์เพิกถอนความยินยอมให้เก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้งาน ผู้ใช้งานสามารถติดต่อผู้อนุญาตได้ที่
                                    </p>
                                    <p className="indent-6 mb-2">
                                    บริษัท รวมถาวรขนส่ง จำกัด
                                    </p>
                                    <p className="indent-6 mb-2">
                                    ติดต่อ : ฝ่ายขายและปฏิบัติการ อีเมล์ : Info@rttgroups.com
                                    </p>
                                    <p className="indent-6 mb-2">
                                    หมายเลขโทรศัพท์: 0-2312-2929
                                    </p>
                                    <p className="indent-6 mb-2">
                                    ที่อยู่ สำนักงานแห่งใหญ่ เลขที่ 2/4 หมู่ 10 ถ.เทพารักษ์ ต.บางปลา อ.บางพลี จ.สมุทรปราการ 10540
                                    </p>
                                    <br />
                                    <br />
                                    <p className="indent-6 mb-2">
                                    นโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ ถูกจัดทำขึ้นเพื่อให้สอดคล้องกับ พระราชบัญญัติ คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 และถูกเผยแพร่ในรูปแบบของภาษาไทยและภาษาอังกฤษ หากมีความไม่สอดคล้องในความหมายหรือการตีความระหว่างภาษาไทยและภาษาอังกฤษให้ยึดถือตามภาษาไทยเป็นหลัก
                                    </p>
                                </div>
                            </div>
                            
                        </div>
                    {/* </DialogContentText> */}
                </DialogContent>
                <DialogActions sx={{
                    '&.MuiDialogActions-root': {
                        flexDirection: 'column',
                        alignItems: 'baseline'
                    }
                }}>
                    <div className="block px-2">
                        <FormControlLabel
                            control={
                                <Checkbox checked={checked} onChange={handleChange} name="gilad" />
                            }
                            label="Are you agree with our Policy"
                        />
                        {/* <Checkbox defaultValue={false} checked={checked}
                            label={'avjlskdjflk sdjdslk fjlkd'}
                            onChange={handleChange} inputProps={{ 'aria-label': 'controlled' }}
                        />
                        <span>Bạn có đồng ý với điều khoản không</span> */}
                        <br />
                    </div>
                    <div className="flex px-2 flex-1 items-centers w-full gap-[20px] ml-0">
                        <Button className="flex-1" size="large" variant="contained" disabled={!checked} onClick={checkedPolicy}>Agree</Button>
                        <Button className="flex-1" variant="outlined" size="large" onClick={handleClose}>Disagree</Button>
                    </div>
                </DialogActions>
            </Dialog>
        </>
    );
};

export default LoginUsername;
